Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::DesignOptionManager Class Reference
Design Options
A class that contains design option related functions. More...
#include <DesignOptionManager.hpp>
 Inheritance diagram for ACAPI::DesignOptions::DesignOptionManager:
 Public Member Functions
Result< DesignOptionCombinationViewSettings >  | GetDesignOptionCombinationSettingsOf (const ACAPI::ModelViews::View &view) const
Result< std::vector< DesignOptionCombination > >  | GetDesignOptionCombinations () const
Result< std::vector< DesignOptionSet > >  | GetDesignOptionSets () const
Result< std::vector< DesignOption > >  | GetDesignOptionsOfSet (const DesignOptionSet &set) const
Result< std::vector< DesignOption > >  | GetActiveDesignOptionsOfCombination (const DesignOptionCombination &combination) const
Result< std::vector< DesignOption > >  | GetAllDesignOptions () const
Result< std::vector< API_Guid > >  | GetElementsOfDesignOption (const DesignOption &option) const
Result< HotlinkDesignOptionTable >  | GetHotlinkDesignOptionTable (const API_HotlinkNode &hotlinkNode) const
Result< HotlinkDesignOptionTable >  | GetHotlinkInstanceDesignOptionTable (const API_HotlinkType &hotlink) const
Result< void >  | SetHotlinkDesignOptionTable (API_HotlinkType &hotlink, const HotlinkDesignOptionTable &designOptionTable) const
Set Design Option data of the given hotlink instance.
Result< API_Guid >  | GetTWID () const
This function is used to get the guid of the Design Option object set. This guid can be used for TW reserve/release.
Result< void >  | CanBeMovedToOtherDesignOption (const API_Guid &elemGuid) const
Result< DesignOption >  | CreateDesignOption (const DesignOptionSet &designOptionSet, const std::optional< DesignOption > &prevDesignOption, const GS::UniString &name, const GS::UniString &id)
Creates a new design option in the given set.
Result< void >  | DeleteDesignOption (const DesignOption &designOption)
Deletes the Design Option.
Result< void >  | MoveDesignOptionToOtherSet (const DesignOption &designOption, const DesignOptionSet &designOptionSet)
Moves the design option to an other set. The design option will be the last in this set.
Result< void >  | MoveDesignOptionWithinSet (const DesignOption &designOption, const std::optional< DesignOption > &nextDesignOption)
Moves the design option within the set.
Result< void >  | SetDesignOptionAsDefault (const std::optional< DesignOption > &designOption)
Sets the design option as default.
Result< void >  | RelinkElementToDesignOption (const API_Guid &elemGuid, const std::optional< DesignOption > &designOption)
Relinks the given element represented by elemGuid to the given design option.
Result< DesignOptionSet >  | CreateDesignOptionSet (const std::optional< DesignOptionSet > &prevDesignOptionSet, const GS::UniString &name)
Creates a new design option set.
Result< void >  | DeleteDesignOptionSet (const DesignOptionSet &designOptionSet)
Deletes the Design Option Set.
Result< void >  | MoveDesignOptionSet (const DesignOptionSet &designOptionSet, const std::optional< DesignOptionSet > &nextOptionSet)
Moves the Design Option Set.
Result< DesignOptionCombination >  | CreateDesignOptionCombination (const GS::UniString &name)
Creates a new design option combination.
Result< void >  | DeleteDesignOptionCombination (const DesignOptionCombination &designOptionCombination)
Deletes the Design Option Combination.
Result< void >  | ActivateDesignOptionInCombination (const DesignOptionCombination &designOptionCombination, const DesignOption &designOption)
Activates a design option in a design option combination.
Result< void >  | DeactivateDesignOptionInCombination (const DesignOptionCombination &designOptionCombination, const DesignOption &designOption)
Deactivates a design option in a design option combination.
Result< void >  | SetActiveOptionsInCombination (const DesignOptionCombination &designOptionCombination, const std::vector< DesignOption > &designOptions)
Activates a list design options in a design option combination.
Result< DesignOptionCombination >  | DuplicateDesignOptionCombination (const DesignOptionCombination &sourceCombination)
Duplicates a design option combination.
Result< ElemDesignOptionStatus >  | GetDesignOptionStatusOf (const API_Guid &elemGuid) const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< DesignOptionManager >  | CreateDesignOptionManager ()
A function to create design option manager instance, that lets you query and manipulate design option related data.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that contains design option related functions.
Since
Archicad 27
Member Function Documentation
◆ ActivateDesignOptionInCombination()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::ActivateDesignOptionInCombination  |  ( |  const DesignOptionCombination & |  designOptionCombination,
|  const DesignOption & |  designOption )
Activates a design option in a design option combination.
Returns
Result of the activation
Parameters
designOptionCombination | The design option combination in which the option will be activated
designOption | The design option to activate
Precondition
This call needs undo scope. The elements should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function activates the first design option of every set in a combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 auto combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 auto combinations = combinationsResult.Unwrap ();
 if (combinations.empty ()) {
 WriteReport ("You have no Design Option Combinations.");
 return;
 }
 auto setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto sets = setsResult.Unwrap ();
 if (sets.empty ()) {
 WriteReport ("You have no Design Option Sets.");
 return;
 }
 auto combinationName = GetTextFromUser ("Select a combination");
 auto combinationToModify = std::find_if (
 combinations.begin (),
 combinations.end (),
 [&combinationName] (const auto& combination) {
 return combination.GetName () == combinationName;
 }
 );
 if (combinationToModify == combinations.end ()) {
 WriteReport ("The given design option combination does not exist.");
 return;
 }
 for (auto& set : sets) {
 auto optionsResult = manager->GetDesignOptionsOfSet (set);
 if (!optionsResult.IsOk ()) {
 WriteReport ("Failed to get Design Options.");
 return;
 }
 auto options = optionsResult.Unwrap ();
 if (!options.empty ()) {
 auto err = ACAPI_CallUndoableCommand ("Activate design option in combination", [&] () -> GSErrCode {
 auto result = manager->ActivateDesignOptionInCombination (*combinationToModify, options[0]);
 if (result.IsErr ()) {
 WriteReport (result.UnwrapErr ().text.c_str ());
 return result.UnwrapErr ().kind;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to activate design option.");
 }
 }
 }
◆ CanBeMovedToOtherDesignOption()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::CanBeMovedToOtherDesignOption  |  ( |  const API_Guid & |  elemGuid | ) |   const
Returns
Whether the provided element can be moved to another design option.
Parameters
elemGuid | Guid of the element.
Example code snippets from Test / Design Options
 if (manager->CanBeMovedToOtherDesignOption (selectedElement).IsErr ()) {
 return Error;
 }
◆ CreateDesignOption()
 Result< DesignOption > ACAPI::DesignOptions::DesignOptionManager::CreateDesignOption  |  ( |  const DesignOptionSet & |  designOptionSet,
|  const std::optional< DesignOption > & |  prevDesignOption,
|  const GS::UniString & |  name,
|  const GS::UniString & |  id )
Creates a new design option in the given set.
Returns
The created item
Parameters
designOptionSet | The set in which the design option will be created.
prevDesignOption | The name of the design option after which the new design option should be created. If this is std::nullopt, then the new option will be created as the first design option in the set.
id | The id of the new design option.
name | The name of the new design option.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function creates a design option, and appends it to the design options in the first set.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 std::optional<ACAPI::DesignOptions::DesignOption> prevOption;
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> optionsResult = manager->GetDesignOptionsOfSet (apiSets.front ());
 if (optionsResult.IsOk ()) {
 auto apiOptions = optionsResult.Unwrap ();
 if (!apiOptions.empty ()) {
 prevOption = apiOptions.back ();
 }
 }
 ACAPI_CallUndoableCommand ("Undo Create Design Option", [&] () -> GSErrCode {
 auto createResult = manager->CreateDesignOption (apiSets.front (), prevOption, "TestDOName", "TestDOId");
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ CreateDesignOptionCombination()
 Result< DesignOptionCombination > ACAPI::DesignOptions::DesignOptionManager::CreateDesignOptionCombination  |  ( |  const GS::UniString & |  name | )
Creates a new design option combination.
Returns
The created item
Parameters
name | The name of the new design option combination.
Precondition
This call needs undo scope. The combination should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function creates a design option combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI_CallUndoableCommand ("Undo Create Design Option Combination", [&] () -> GSErrCode {
 auto createResult = manager->CreateDesignOptionCombination ("TestDOCombination");
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ CreateDesignOptionSet()
 Result< DesignOptionSet > ACAPI::DesignOptions::DesignOptionManager::CreateDesignOptionSet  |  ( |  const std::optional< DesignOptionSet > & |  prevDesignOptionSet,
|  const GS::UniString & |  name )
Creates a new design option set.
Returns
The created item
Parameters
prevDesignOptionSet | The name of the design option set after which the new design option set should be created. If this is std::nullopt, then the new option set will be created as the first.
name | The name of the new design option set.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function creates a design option set, and appends it after the first set (if there is one).
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 ACAPI_CallUndoableCommand ("Undo Create Design Option Set", [&] () -> GSErrCode {
 auto createResult = manager->CreateDesignOptionSet (std::nullopt, "TestDOSetNameFirst");
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
 } else {
 ACAPI_CallUndoableCommand ("Undo Create Design Option Set", [&] () -> GSErrCode {
 auto createResult = manager->CreateDesignOptionSet (apiSets.front (), "TestDOSetName");
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
 }
◆ DeactivateDesignOptionInCombination()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::DeactivateDesignOptionInCombination  |  ( |  const DesignOptionCombination & |  designOptionCombination,
|  const DesignOption & |  designOption )
Deactivates a design option in a design option combination.
Returns
Result of the deactivation
Parameters
designOptionCombination | The design option combination in which the option will be deactivated
designOption | The design option to deactivate
Precondition
This call needs undo scope. The elements should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function activates the first design option of every set in a combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 auto combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 auto combinations = combinationsResult.Unwrap ();
 if (combinations.empty ()) {
 WriteReport ("You have no Design Option Combinations.");
 return;
 }
 auto setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto sets = setsResult.Unwrap ();
 if (sets.empty ()) {
 WriteReport ("You have no Design Option Sets.");
 return;
 }
 auto combinationName = GetTextFromUser ("Select a combination");
 auto combinationToModify = std::find_if (
 combinations.begin (),
 combinations.end (),
 [&combinationName] (const auto& combination) {
 return combination.GetName () == combinationName;
 }
 );
 if (combinationToModify == combinations.end ()) {
 WriteReport ("The given design option combination does not exist.");
 return;
 }
 for (auto& set : sets) {
 auto optionsResult = manager->GetDesignOptionsOfSet (set);
 if (!optionsResult.IsOk ()) {
 WriteReport ("Failed to get Design Options.");
 return;
 }
 auto options = optionsResult.Unwrap ();
 if (!options.empty ()) {
 auto err = ACAPI_CallUndoableCommand ("Activate design option in combination", [&] () -> GSErrCode {
 auto result = manager->ActivateDesignOptionInCombination (*combinationToModify, options[0]);
 if (result.IsErr ()) {
 WriteReport (result.UnwrapErr ().text.c_str ());
 return result.UnwrapErr ().kind;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to activate design option.");
 }
 }
 }
◆ DeleteDesignOption()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::DeleteDesignOption  |  ( |  const DesignOption & |  designOption | )
Deletes the Design Option.
Returns
Result of the deletion
Parameters
designOption | The design option to delete.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function deletes the last design option from the first non empty set.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 auto firstNonEmptySet = std::find_if (
 apiSets.begin (),
 apiSets.end (),
 [&manager] (const auto& apiSet) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> optionsResult = manager->GetDesignOptionsOfSet (apiSet);
 return optionsResult.IsOk () && !optionsResult->empty ();
 }
 );
 if (firstNonEmptySet == apiSets.end ()) {
 WriteReport ("You have no design option. First, you have to create one!");
 return;
 }
 auto apiOption = manager->GetDesignOptionsOfSet (*firstNonEmptySet).Unwrap ().back ();
 ACAPI_CallUndoableCommand ("Undo Delete Design Option", [&] () -> GSErrCode {
 auto createResult = manager->DeleteDesignOption (apiOption);
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ DeleteDesignOptionCombination()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::DeleteDesignOptionCombination  |  ( |  const DesignOptionCombination & |  designOptionCombination | )
Deletes the Design Option Combination.
Returns
Result of the deletion
Parameters
designOptionCombination | The design option combination to delete.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function deletes a design option combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionCombination>> combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 auto combinations = combinationsResult.Unwrap ();
 if (combinations.empty ()) {
 WriteReport ("You have no design option combinations.");
 return;
 }
 auto combinationName = GetTextFromUser ("Select a combination");
 auto combinationToDelete = std::find_if (
 combinations.begin (),
 combinations.end (),
 [&combinationName] (const auto& combination) {
 return combination.GetName () == combinationName;
 }
 );
 if (combinationToDelete == combinations.end ()) {
 WriteReport ("The given design option combination does not exist.");
 return;
 }
 auto err = ACAPI_CallUndoableCommand ("Undo Delete Design Option Combination", [&] () -> GSErrCode {
 auto deleteResult = manager->DeleteDesignOptionCombination (*combinationToDelete);
 if (deleteResult.IsErr ()) {
 WriteReport (deleteResult.UnwrapErr ().text.c_str ());
 return deleteResult.UnwrapErr ().kind;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to delete design option combination.");
 return;
 }
◆ DeleteDesignOptionSet()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::DeleteDesignOptionSet  |  ( |  const DesignOptionSet & |  designOptionSet | )
Deletes the Design Option Set.
Returns
Result of the deletion
Parameters
designOptionSet | The design option set to delete.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function deletes the first empty design option set.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.size () == 0) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 auto firstEmptySet = std::find_if (
 apiSets.begin (),
 apiSets.end (),
 [&manager] (const auto& apiSet) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> optionsResult = manager->GetDesignOptionsOfSet (apiSet);
 return (optionsResult.IsOk () && optionsResult->empty ());
 }
 );
 if (firstEmptySet == apiSets.end ()) {
 WriteReport ("You have no empty design option set. First, you have to create one!");
 return;
 }
 ACAPI_CallUndoableCommand ("Undo Delete Design Option Set", [&] () -> GSErrCode {
 auto deleteResult = manager->DeleteDesignOptionSet (*firstEmptySet);
 if (deleteResult.IsErr ()) {
 WriteReport (deleteResult.UnwrapErr ().text.c_str ());
 return deleteResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ DuplicateDesignOptionCombination()
 Result< DesignOptionCombination > ACAPI::DesignOptions::DesignOptionManager::DuplicateDesignOptionCombination  |  ( |  const DesignOptionCombination & |  sourceCombination | )
Duplicates a design option combination.
Returns
The new combination created by the duplication
Parameters
sourceCombination | The design option combination to duplicate
Precondition
This call needs undo scope. The elements should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function duplicates a design option combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 auto combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 auto combinations = combinationsResult.Unwrap ();
 if (combinations.empty ()) {
 WriteReport ("You have no Design Option Combinations.");
 return;
 }
 auto combinationName = GetTextFromUser ("Select a combination");
 auto combinationToDuplicate = std::find_if (
 combinations.begin (),
 combinations.end (),
 [&combinationName] (const auto& combination) {
 return combination.GetName () == combinationName;
 }
 );
 if (combinationToDuplicate == combinations.end ()) {
 WriteReport ("The given design option combination does not exist.");
 return;
 }
 ACAPI_CallUndoableCommand ("Duplicate design option combination", [&] () -> GSErrCode {
 auto result = manager->DuplicateDesignOptionCombination (*combinationToDuplicate);
 if (result.IsErr ()) {
 WriteReport (result.UnwrapErr ().text.c_str ());
 return result.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ GetActiveDesignOptionsOfCombination()
 Result< std::vector< DesignOption > > ACAPI::DesignOptions::DesignOptionManager::GetActiveDesignOptionsOfCombination  |  ( |  const DesignOptionCombination & |  combination | ) |   const
Returns
A list of the active design options in the given combination, or an error if the combination is invalid.
Parameters
combination | The combination whose design options are requested.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto combinations = manager->GetDesignOptionCombinations ();
 if (combinations.IsErr ()) {
 WriteReport ("Failed to get design option combinations.");
 return;
 }
 if (combinations.Unwrap ().empty ()) {
 WriteReport ("There are no design option combinations.");
 return;
 }
 const auto combination = combinations.Unwrap ()[0];
 const auto options = manager->GetActiveDesignOptionsOfCombination (combination);
 if (options.IsErr ()) {
 WriteReport ("Failed to get active design options of first combination.");
 return;
 }
 WriteReport ("Active options of combination %s:", combination.GetName ().ToCStr ().Get ());
 for (const auto& option : options.Unwrap ()) {
 WriteReport ("%s (%s)", option.GetName ().ToCStr ().Get (), option.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetAllDesignOptions()
 Result< std::vector< DesignOption > > ACAPI::DesignOptions::DesignOptionManager::GetAllDesignOptions  |  ( |   | ) |   const
Returns
A list of the design options in the project.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto options = manager->GetAllDesignOptions ();
 if (options.IsErr ()) {
 WriteReport ("Failed to get design options.");
 return;
 }
 if (options.Unwrap ().empty ()) {
 WriteReport ("There are no design options.");
 return;
 }
 for (const auto& option : options.Unwrap ()) {
 WriteReport ("%s (%s)", option.GetName ().ToCStr ().Get (), option.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetDesignOptionCombinations()
 Result< std::vector< DesignOptionCombination > > ACAPI::DesignOptions::DesignOptionManager::GetDesignOptionCombinations  |  ( |   | ) |   const
Returns
A list of the design option combinations in the project
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto combinations = manager->GetDesignOptionCombinations ();
 if (combinations.IsErr ()) {
 WriteReport ("Failed to get design option combinations.");
 return;
 }
 for (const auto& combination : combinations.Unwrap ()) {
 WriteReport ("%s (%s)", combination.GetName ().ToCStr ().Get (), combination.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetDesignOptionCombinationSettingsOf()
 Result< DesignOptionCombinationViewSettings > ACAPI::DesignOptions::DesignOptionManager::GetDesignOptionCombinationSettingsOf  |  ( |  const ACAPI::ModelViews::View & |  view | ) |   const
Returns
The design option combination of a view.
Parameters
view | The view of which the design option combination is requested.
Example code snippets from Test / Design Options
Get
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Status> status = settings->GetStatus ();
 if (status.IsErr ()) {
 continue;
 }
 const GS::UniString itemId (item.uiId);
 const GS::UniString itemIdPrefix = !itemId.IsEmpty () ? itemId + " " : GS::EmptyUniString;
 const GS::UniString itemName (item.uName);
 const GS::UniString fullName = itemIdPrefix + itemName;
 std::visit (
 GS::Overloaded {
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::MainModelOnly&) {
 WriteReport ("%s: Main Model Only.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Standard& standard) {
 WriteReport ("%s: %s.", fullName.ToCStr ().Get (), standard.combination.GetName ().ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Custom& /*custom*/) {
 WriteReport ("%s: Custom.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Missing&) {
 WriteReport ("%s: Missing.", fullName.ToCStr ().Get ());
 },
 },
 status.Unwrap ()
 );
 }
 Set
 const ACAPI::Result<std::vector<API_NavigatorItem>> mapItems = GetLeafNavigatorItems (API_PublicViewMap);
 if (mapItems.IsErr ()) {
 WriteReport ("Failed to get navigator map items.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 ACAPI_CallUndoableCommand ("Undo Set Design Option Combinations To Main Model", [&] () -> GSErrCode {
 settings->SetMainModelOnly ();
 return NoError;
 });
 }
◆ GetDesignOptionSets()
 Result< std::vector< DesignOptionSet > > ACAPI::DesignOptions::DesignOptionManager::GetDesignOptionSets  |  ( |   | ) |   const
Returns
A list of the design option sets in the project.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto sets = manager->GetDesignOptionSets ();
 if (sets.IsErr ()) {
 WriteReport ("Failed to get design option sets.");
 return;
 }
 if (sets.Unwrap ().empty ()) {
 WriteReport ("There are no design option sets.");
 return;
 }
 for (const auto& set : sets.Unwrap ()) {
 WriteReport ("%s (%s)", set.GetName ().ToCStr ().Get (), set.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetDesignOptionsOfSet()
 Result< std::vector< DesignOption > > ACAPI::DesignOptions::DesignOptionManager::GetDesignOptionsOfSet  |  ( |  const DesignOptionSet & |  set | ) |   const
Returns
A list of the design options in the given set, or an error if the set is invalid.
Parameters
set | The set whose design options are requested.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto sets = manager->GetDesignOptionSets ();
 if (sets.IsErr ()) {
 WriteReport ("Failed to get design option sets.");
 return;
 }
 if (sets.Unwrap ().empty ()) {
 WriteReport ("There are no design option sets.");
 return;
 }
 const auto set = sets.Unwrap ()[0];
 const auto options = manager->GetDesignOptionsOfSet (set);
 if (options.IsErr ()) {
 WriteReport ("Failed to get design options of first set.");
 return;
 }
 WriteReport ("Design options of set %s:", set.GetName ().ToCStr ().Get ());
 for (const auto& option : options.Unwrap ()) {
 WriteReport ("%s (%s)", option.GetName ().ToCStr ().Get (), option.GetGuid ().ToUniString ().ToCStr ().Get ());
 }
◆ GetDesignOptionStatusOf()
 Result< ElemDesignOptionStatus > ACAPI::DesignOptions::DesignOptionManager::GetDesignOptionStatusOf  |  ( |  const API_Guid & |  elemGuid | ) |   const
Returns
The design option status of the provided element.
Parameters
elemGuid | Guid of the element.
Example code snippets from Test / Design Options
 const auto guidString = APIGuidToString (elemGuid);
 const auto elemDesignOptionStatus = manager->GetDesignOptionStatusOf (elemGuid);
 if (elemDesignOptionStatus.IsErr ()) {
 WriteReport ("Failed to get Design Option Status for Element with guid '%s.'", guidString.ToCStr ().Get ());
 return;
 }
 std::visit (
 GS::Overloaded {
 [&guidString] (const ACAPI::DesignOptions::DesignOption& designOption) {
 WriteReport ("Element with guid '%s': Design option name: %s, id: %s, Set name: %s",
 guidString.ToCStr ().Get (),
 designOption.GetName ().ToCStr ().Get (),
 designOption.GetId ().ToCStr ().Get (),
 designOption.GetOwnerSetName ().ToCStr ().Get ());
 },
 [&guidString] (const ACAPI::DesignOptions::MissingDesignOption&) {
 WriteReport ("Element with guid '%s' has Missing Design Option", guidString.ToCStr ().Get ());
 },
 [&guidString] (const ACAPI::DesignOptions::MainModelDesignOption&) {
 WriteReport ("Element with guid '%s' is in Main Model", guidString.ToCStr ().Get ());
 }
 },
 elemDesignOptionStatus.Unwrap ()
 );
◆ GetElementsOfDesignOption()
 Result< std::vector< API_Guid > > ACAPI::DesignOptions::DesignOptionManager::GetElementsOfDesignOption  |  ( |  const DesignOption & |  option | ) |   const
Returns
A list of elements linked to a design option.
Parameters
option | The option whose linked elements are requested.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 const auto options = manager->GetAllDesignOptions ();
 if (options.IsErr ()) {
 WriteReport ("Failed to get design options.");
 return;
 }
 if (options.Unwrap ().empty ()) {
 WriteReport ("There are no design options.");
 return;
 }
 const auto option = options.Unwrap ()[0];
 const auto elements = manager->GetElementsOfDesignOption (option);
 if (elements.IsErr ()) {
 WriteReport ("Failed to get elements linked to the first design option.");
 return;
 }
 WriteReport ("Elements of design option %s:", option.GetName ().ToCStr ().Get ());
 for (const auto& elemGuid : elements.Unwrap ()) {
 GS::Array<API_Property> properties;
 GS::Array<API_Guid> propertyGuids = {APIGuidFromString ("7E221F33-829B-4FBC-A670-E74DABCE6289")}; //guid of Property::GeneralElementIDPropertyId
 GSErrCode err = ACAPI_Element_GetPropertyValuesByGuid (elemGuid, propertyGuids, properties);
 if (err != NoError) {
 WriteReport ("Failed to get value for %s", APIGuidToString (elemGuid).ToCStr ().Get ());
 return;
 }
 GS::UniString valueInString;
 ACAPI_Property_GetPropertyValueString (properties.GetFirst (), &valueInString);
 WriteReport ("%s (%s)", valueInString.ToCStr ().Get (), APIGuidToString (elemGuid).ToCStr ().Get ());
 }
◆ GetHotlinkDesignOptionTable()
 Result< HotlinkDesignOptionTable > ACAPI::DesignOptions::DesignOptionManager::GetHotlinkDesignOptionTable  |  ( |  const API_HotlinkNode & |  hotlinkNode | ) |   const
Returns
A table of the available design options and combinations in the hotlink node.
Parameters
hotlinkNode | The hotlink node whose design option table is requested.
Example code snippets from Test / Design Options
 API_HotlinkNode hotlinkNode = {};
 GS::Optional<API_Element> clickedHotlink = GetPlacedHotlinkByClickOnElement ();
 if (clickedHotlink.HasValue ()) {
 hotlinkNode.guid = clickedHotlink.Get ().hotlink.hotlinkNodeGuid;
 } else {
 WriteReport ("Failed to get Hotlinknode.");
 return;
 }
 GSErrCode err = ACAPI_Hotlink_GetHotlinkNode (&hotlinkNode);
 if (err != NoError)
 return;
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::HotlinkDesignOptionTable> result = manager->GetHotlinkDesignOptionTable (hotlinkNode);
 if (result.IsErr ()) {
 WriteReport ("Failed to get Design Option Table of a hotlinknode.");
 return;
 }
 ACAPI::DesignOptions::HotlinkDesignOptionTable& hotlinkDesignOptionTable = result.Unwrap ();
 WriteReport ("Design option sets and options:");
 for (const GS::UniString& setName : hotlinkDesignOptionTable.GetSetsNames ()) {
 WriteReport ("%s:", setName.ToCStr ().Get ());
 for (const GS::UniString& optionName : hotlinkDesignOptionTable.GetOptionsNamesOfSet (setName)) {
 WriteReport (" %s", optionName.ToCStr ().Get ());
 }
 }
 WriteReport ("Design option combinations:");
 for (const GS::UniString& combinationName : hotlinkDesignOptionTable.GetCombinationsNames ()) {
 WriteReport ("%s", combinationName.ToCStr ().Get ());
 }
◆ GetHotlinkInstanceDesignOptionTable()
 Result< HotlinkDesignOptionTable > ACAPI::DesignOptions::DesignOptionManager::GetHotlinkInstanceDesignOptionTable  |  ( |  const API_HotlinkType & |  hotlink | ) |   const
Returns
A table of the available and active design options and combinations in the hotlink instance.
Parameters
hotlink | The hotlink instance whose design option table is requested.
Example code snippets from Test / Design Options
 API_HotlinkType hotlinkElem = {};
 GS::Optional<API_Element> clickedHotlink = GetPlacedHotlinkByClickOnElement ();
 if (clickedHotlink.HasValue ()) {
 hotlinkElem = clickedHotlink.Get ().hotlink;
 } else {
 WriteReport ("Failed to get Hotlink elem.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::HotlinkDesignOptionTable> result = manager->GetHotlinkInstanceDesignOptionTable (hotlinkElem);
 if (result.IsErr ()) {
 WriteReport ("Failed to get Design Option Table of a hotlink.");
 return;
 }
 ACAPI::DesignOptions::HotlinkDesignOptionTable& hotlinkDesignOptionTable = result.Unwrap ();
 WriteReport ("Design option sets and options:");
 for (const GS::UniString& setName : hotlinkDesignOptionTable.GetSetsNames ()) {
 WriteReport ("%s:", setName.ToCStr ().Get ());
 for (const GS::UniString& optionName : hotlinkDesignOptionTable.GetOptionsNamesOfSet (setName)) {
 WriteReport (" %s", optionName.ToCStr ().Get ());
 }
 }
 WriteReport ("Design option combinations:");
 for (const GS::UniString& combinationName : hotlinkDesignOptionTable.GetCombinationsNames ()) {
 WriteReport ("%s", combinationName.ToCStr ().Get ());
 }
 switch (hotlinkDesignOptionTable.GetFilterMode ()) {
 case HotlinkDesignOptionTable::FilterMode::MainModelOnly:
 {
 WriteReport ("Filter setting: %s", "MainModelOnly");
 break;
 }
 case HotlinkDesignOptionTable::FilterMode::FilterByOptions:
 {
 WriteReport ("Filter setting: %s", "FilterByOptions");
 for (const auto& set : hotlinkDesignOptionTable.GetSetsNames ()) {
 std::optional<GS::UniString> activeInSet = hotlinkDesignOptionTable.GetActiveOptionInSet (set);
 if (activeInSet) {
 WriteReport ("%s: %s", set.ToCStr ().Get (), activeInSet.value ().ToCStr ().Get ());
 }
 }
 break;
 }
 case HotlinkDesignOptionTable::FilterMode::FilterByCombination:
 {
 WriteReport ("Filter setting: %s", "FilterByCombination");
 std::optional<GS::UniString> activeCombination = hotlinkDesignOptionTable.GetActiveCombination ();
 if (activeCombination) {
 WriteReport ("%s", activeCombination.value ().ToCStr ().Get ());
 }
 break;
 }
 default:
 break;
 }
◆ GetTWID()
 Result< API_Guid > ACAPI::DesignOptions::DesignOptionManager::GetTWID  |  ( |   | ) |   const
This function is used to get the guid of the Design Option object set. This guid can be used for TW reserve/release.
Returns
The guid of the object set.
◆ MoveDesignOptionSet()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::MoveDesignOptionSet  |  ( |  const DesignOptionSet & |  designOptionSet,
|  const std::optional< DesignOptionSet > & |  nextOptionSet )
Moves the Design Option Set.
Returns
Result of the movement.
Parameters
designOptionSet | The design option set to move.
nextOptionSet | The option set before which the current option set will be placed. If this is std::nullopt, then the current option set will be moved to the end.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Get Available Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 ACAPI_CallUndoableCommand ("Undo Move Design Option Set", [&] () -> GSErrCode {
 auto moveResult = manager->MoveDesignOptionSet (apiSets.front (), apiSets.back ());
 if (moveResult.IsErr ()) {
 WriteReport (moveResult.UnwrapErr ().text.c_str ());
 return moveResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ MoveDesignOptionToOtherSet()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::MoveDesignOptionToOtherSet  |  ( |  const DesignOption & |  designOption,
|  const DesignOptionSet & |  designOptionSet )
Moves the design option to an other set. The design option will be the last in this set.
Returns
Result of the movement
Parameters
designOption | The design option to move.
designOptionSet | The set into which the design option will be moved.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 auto firstNonEmptySet = std::find_if (
 apiSets.begin (),
 apiSets.end (),
 [&manager] (const auto& apiSet) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> optionsResult = manager->GetDesignOptionsOfSet (apiSet);
 return optionsResult.IsOk () && !optionsResult->empty ();
 }
 );
 if (firstNonEmptySet == apiSets.end ()) {
 WriteReport ("You have no design option. First, you have to create one!");
 return;
 }
 auto apiOptionToMove = manager->GetDesignOptionsOfSet (*firstNonEmptySet).Unwrap ().front ();
 ACAPI_CallUndoableCommand ("Undo Move Design Option to Other Set", [&] () -> GSErrCode {
 auto moveResult = manager->MoveDesignOptionToOtherSet (apiOptionToMove, apiSets.back ());
 if (moveResult.IsErr ()) {
 WriteReport (moveResult.UnwrapErr ().text.c_str ());
 return moveResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ MoveDesignOptionWithinSet()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::MoveDesignOptionWithinSet  |  ( |  const DesignOption & |  designOption,
|  const std::optional< DesignOption > & |  nextDesignOption )
Moves the design option within the set.
Returns
Result of the movement
Parameters
designOption | The design option to move.
nextDesignOption | The option before which the design option will be placed. If this is std::nullopt, then the design option will be moved to the end.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> setsResult = manager->GetDesignOptionSets ();
 if (!setsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 auto apiSets = setsResult.Unwrap ();
 if (apiSets.empty ()) {
 WriteReport ("You have no design option set. First, you have to create one!");
 return;
 }
 auto firstNonEmptySet = std::find_if (
 apiSets.begin (),
 apiSets.end (),
 [&manager] (const auto& apiSet) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> optionsResult = manager->GetDesignOptionsOfSet (apiSet);
 return optionsResult.IsOk () && !optionsResult->empty ();
 }
 );
 if (firstNonEmptySet == apiSets.end ()) {
 WriteReport ("You have no design option. First, you have to create one!");
 return;
 }
 auto apiOptionToMove = manager->GetDesignOptionsOfSet (*firstNonEmptySet).Unwrap ().back ();
 auto firstApiOption = manager->GetDesignOptionsOfSet (*firstNonEmptySet).Unwrap ().front ();
 ACAPI_CallUndoableCommand ("Undo Move Design Option within Set", [&] () -> GSErrCode {
 auto moveResult = manager->MoveDesignOptionWithinSet (apiOptionToMove, firstApiOption);
 if (moveResult.IsErr ()) {
 WriteReport (moveResult.UnwrapErr ().text.c_str ());
 return moveResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ RelinkElementToDesignOption()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::RelinkElementToDesignOption  |  ( |  const API_Guid & |  elemGuid,
|  const std::optional< DesignOption > & |  designOption )
Relinks the given element represented by elemGuid to the given design option.
Returns
Whether the relink operation was successful
Parameters
elemGuid | The guid of the element to be moved to another design option
designOption | The optional design option the element should be moved into. If it is std::nullopt the element will be moved back to the main model.
Precondition
This call needs undo scope. The element should be modifiable.
Example code snippets from Test / Design Options
 ACAPI_CallUndoableCommand ("Undo Relink Element To Design Option", [&] () -> GSErrCode {
 for (auto& selectedElement : selection) {
 // ! [Can-Be-Moved-To-Other-Design-Option]
 if (manager->CanBeMovedToOtherDesignOption (selectedElement).IsErr ()) {
 return Error;
 }
 // ! [Can-Be-Moved-To-Other-Design-Option]
 if (toMainModel) {
 auto result = manager->RelinkElementToDesignOption (selectedElement, std::nullopt);
 if (result.IsErr ()) {
 return Error;
 }
 } else {
 auto designOptionsOfFirstSet = manager->GetDesignOptionsOfSet (designOptionSets.Unwrap ()[0]);
 if (designOptionsOfFirstSet.Unwrap ().empty ()) {
 return Error;
 }
 auto result = manager->RelinkElementToDesignOption (selectedElement, designOptionsOfFirstSet.Unwrap ()[0]);
 if (result.IsErr ()) {
 return Error;
 }
 }
 }
 return NoError;
 });
◆ SetActiveOptionsInCombination()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::SetActiveOptionsInCombination  |  ( |  const DesignOptionCombination & |  designOptionCombination,
|  const std::vector< DesignOption > & |  designOptions )
Activates a list design options in a design option combination.
Returns
Result of the activations
Parameters
designOptionCombination | The design option combination in which the options will be activated
designOptions | The design options to activate
Precondition
This call needs undo scope. The elements should be modifiable.
Example code snippets from Test / Design Options
 /*
 This function deactivates every design option in a combination.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 auto combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 auto combinations = combinationsResult.Unwrap ();
 if (combinations.empty ()) {
 WriteReport ("You have no Design Option Combinations.");
 return;
 }
 auto combinationName = GetTextFromUser ("Select a combination");
 auto combinationToModify = std::find_if (
 combinations.begin (),
 combinations.end (),
 [&combinationName] (const auto& combination) {
 return combination.GetName () == combinationName;
 }
 );
 if (combinationToModify == combinations.end ()) {
 WriteReport ("The given design option combination does not exist.");
 return;
 }
 ACAPI_CallUndoableCommand ("Deactivate every design option in combination", [&] () -> GSErrCode {
 auto result = manager->SetActiveOptionsInCombination (*combinationToModify, {});
 if (result.IsErr ()) {
 WriteReport (result.UnwrapErr ().text.c_str ());
 return result.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ SetDesignOptionAsDefault()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::SetDesignOptionAsDefault  |  ( |  const std::optional< DesignOption > & |  designOption | )
Sets the design option as default.
Returns
Whether the set operation was successful
Parameters
designOption | The design option to be set to default. If this is std::nullopt, then the main model will be set as default.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 std::optional<ACAPI::DesignOptions::DesignOption> designOption;
 if (selector == SetDesignOptionAsDefaultSelector::LastDO) {
 const auto options = manager->GetAllDesignOptions ();
 if (options.IsErr ()) {
 WriteReport ("Failed to get design options.");
 return;
 }
 if (options.Unwrap ().empty ()) {
 WriteReport ("There are no design options.");
 return;
 }
 designOption = options.Unwrap ().back ();
 }
 ACAPI_CallUndoableCommand ("Set Design Option As Default", [&] () -> GSErrCode {
 auto createResult = manager->SetDesignOptionAsDefault (designOption);
 if (createResult.IsErr ()) {
 WriteReport (createResult.UnwrapErr ().text.c_str ());
 return createResult.UnwrapErr ().kind;
 }
 return NoError;
 });
◆ SetHotlinkDesignOptionTable()
 Result< void > ACAPI::DesignOptions::DesignOptionManager::SetHotlinkDesignOptionTable  |  ( |  API_HotlinkType & |  hotlink,
|  const HotlinkDesignOptionTable & |  designOptionTable ) const
Set Design Option data of the given hotlink instance.
Returns
An error if the process of modification fails for some reason, otherwise nothing.
Parameters
hotlink | The hotlink whose design option table is set.
designOptionTable | A table that contains the new data
Example code snippets from Test / Design Options
 API_HotlinkNode hotlinkNode = {};
 GS::Optional<API_Element> clickedHotlink = GetPlacedHotlinkByClickOnElement ();
 if (clickedHotlink.HasValue ()) {
 hotlinkNode.guid = clickedHotlink.Get ().hotlink.hotlinkNodeGuid;
 } else {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 GSErrCode err = ACAPI_Hotlink_GetHotlinkNode (&hotlinkNode);
 if (err != NoError)
 return;
 GS::Array<API_Guid> elementRefList;
 err = ACAPI_Hotlink_GetHotlinkInstances (&hotlinkNode.guid, &elementRefList);
 if (err != NoError || elementRefList.IsEmpty ())
 return;
 API_Element element {};
 element.header.guid = elementRefList[0];
 err = ACAPI_Element_Get (&element);
 if (err != NoError)
 return;
 API_HotlinkType hotlink = element.hotlink;
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::HotlinkDesignOptionTable> getterResult = manager->GetHotlinkDesignOptionTable (hotlinkNode);
 if (getterResult.IsErr ()) {
 WriteReport ("Failed to get Design Option Table of a hotlink element.");
 return;
 }
 ACAPI::DesignOptions::HotlinkDesignOptionTable& hotlinkDesignOptionTable = getterResult.Unwrap ();
 std::vector<GS::UniString> setNames = hotlinkDesignOptionTable.GetSetsNames ();
 for (auto& setName : setNames) {
 std::vector<GS::UniString> optionNames = hotlinkDesignOptionTable.GetOptionsNamesOfSet (setName);
 if (!optionNames.empty ()) {
 hotlinkDesignOptionTable.ActivateOptionInSet (setName, optionNames[0]);
 }
 }
 hotlinkDesignOptionTable.SetFilterMode (ACAPI::DesignOptions::HotlinkDesignOptionTable::FilterMode::FilterByOptions);
 err = ACAPI_CallUndoableCommand ("Set Hotlink Design Option Table", [&] () -> GSErrCode {
 ACAPI::Result<void> res = manager->SetHotlinkDesignOptionTable (hotlink, hotlinkDesignOptionTable);
 return res.IsErr () ? Error : NoError;
 });
 if (err != NoError) {
 WriteReport ("Failed to set Design Option Table of a hotlink element.");
 }
Friends And Related Symbol Documentation
◆ CreateDesignOptionManager
 Result< DesignOptionManager > CreateDesignOptionManager  |  ( |   | )
friend
A function to create design option manager instance, that lets you query and manipulate design option related data.
Returns
The design option manager instance.